app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-09 17:24:12.389547"], ["text", "article"], ["title", "new"], ["updated_at", "2014-12-09 17:24:12.389547"]]

  def index
    @articles = Article.order('id')
---
SELECT "articles".* FROM "articles"   ORDER BY id