app/controllers/comments_controller.rb

  def new
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]